{
    "Title": "Island",
    "Credits": "Created by Austin Mendoza (autmendo@ucsc.edu).",
    "InitialLocation": "Hammock",
    "Locations": {
        "Hammock": {
            "Body": "You Awake from your slumber, groggy and disoriented. You look around and see that your on a remote tropical island. You see people in the distance but you are really freaked out and disoriented. ",
            "Choices": [
                {
                    "Text": "Go Towards the people",
                    "Target": "People"
                },
                {
                    "Text": "Run into the forest, and escape?",
                    "Target": "Forest"
                }
            ]
        },
        "People": {
            "Body": "You walk up slowly and a woman turns to you and laughs. HAHAHA, last night was crazy right I barely remember anything! Anyway, I think your girlfriend was asking about you eariler I think see went to go gather fruits in the forest if you want to go find her.",
            "Choices": [
                {
                    "Text": "Follow Christie",
                    "Target": "Boats"
                },
                {
                    "Text": "Head for the forest",
                    "Target": "Forest"
                }
            ]
        },
        "GoingTowardsForest": {
            "Body": "You walk towards the forest and enter moving through the thick tropical jungle",
            "Choices": [
                {
                    "Text": "Continue Through the forest and look for your girlfriend",
                    "Target": "Forest"
                }
            ]

        },
        "Boats": {
            "Body": "you follow them and die!?!?!"
        },
        "Forest": {
            "Body": "You find yourself at a fork in the jungle. You see a path towards a mountainous area, Next to it you see a path to a large clearing with lots of coconut trees.",
            "Place": "Chasing",
            "Choices": [
                {
                    "Text": "Go towards the Mountains",
                    "Target": "Mountain"
                },
                {
                    "Text": "Go towards the clearing",
                    "Target": "Clearing"
                }
            ]
        },
        "Mountain": {
            "Body": "You go up the mountain an struggle as its pretty steep. You eventually reach a hilly meadow where you can see a lot of people next to fishing boats. Some boats are even fishing far out into the ocean just before the reef surrounding the island.",
            "Place": "Mount",
            "Choices": [
                {
                    "Text": "Go back down to the fork in the road",
                    "Target": "Forest"
                }
            ]
            
        },
        "Clearing": {
            "Body": "You look around and hear a strange noise in the distance. You look at the ground and see green coconuts all over the muddy, sandy floor. You suddenly have a strange urge to pick it up. ",
            "Choices": [
                {
                    "Text": "Turn around and go back to the fork in the jungle",
                    "Target": "Forest"
                },
                {
                    "Text": "Pick up the coconut and look at it closer",
                    "Target": "Event"
                }
            ]
        },
        "Event": {
            "Body": "You pick up the coconut and see a memory of you real family. You see your son picking up a green coconut and trying to eat it while everyone laughs. You look up at your wife and smile. She slowly fades away an you come back to reality. You suddenly remeber your family and how they are still alive and you have the sudden urge to find them. However, you stand up and see a leopard creeping up slowly getting ready to pounce.",
            "Place": "Leopard",
            "Choices": [
                {
                    "Text": "Run back to the fork in the road",
                    "Target": "Forest"
                },
                {
                    "Text": "Stand there in shock and fear",
                    "Target": "LeopardDeath"
                }
            ]
        },
        "LeopardDeath": {
            "Body": "You are ripped to shreds and eaten while still alive screaming in pain until you pass out",
            "Place": "Dead"
        },
        "Beach": {
            "Body": "You reach the beach and escape the leopard, you continue sprinting towards a vacant boat.",
            "Choices": [
                {
                    "Text": "Grab the boat",
                    "Target": "Waves"
                }
            ]
        },
        "Waves": {
            "Body": "You push the boat off and people notice and yell at you, asking what you are doing. You set sail and try to get past the first set of huge waves.",
            "Choices": [
                {
                    "Text": "Go diagonally against the waves",
                    "Target": "WaterDeath"
                }
            ]
        },
        "WaterDeath": {
            "Body": "You are knocked into the water and get trapped under the raft. you slowly loose contiousness and drown",
            "Place": "Dead"
        }
    }
}